/*----------------------------------------------------------------------
Создать объект car, добавить к нему свойство color со значением 'черный'
- Изменить свойство color объекта car на 'зеленый'
- В объект car добавить свойство power, которое является функцией 
и выводит в консоль мощность двигателя
------------------------------------------------------------------------*/
const car = {
    color: 'black',
}
car.color = 'green'
console.log(car.color)
car.power = function() {
    console.log('500hp')
}
car.power()



/*----------------------------------------------------------------------
На склад принимают груши и яблоки, напишите функцию, которая возвращает
 результат сложения количества принятых груш и яблок
------------------------------------------------------------------------*/
function quantityCalculation (apples, pears) {
    return confirm(apples + pears)
}
let apples = +prompt('Введите количество яблок')
let pears = +prompt('Введите количество груш')
quantityCalculation(apples, pears)



/*---------------------------------------------------------------------------------------------  
 В терминале оплаты сохранено ваше имя, напишите функцию для определения 
 имени в терминале(если вы ввели ваше имя, то привет + имя, если нет, то нет такого имени)
-----------------------------------------------------------------------------------------------*/
const savedName = 'Jack'
function nameDefinition(enteredName) {
    if (enteredName === savedName) {
        return confirm(`Привет, ${enteredName}`)
    } else {
        return confirm('Нет такого имени')
    }
}
let enteredName = prompt('Введите имя')
nameDefinition(enteredName)



/*---------------------------------------------------------------
Напишите функцию вычисления типа аргумента и вывод типа в консоль
-----------------------------------------------------------------*/ 
function example(type) {
    console.log(typeof(type)) 
}
example('text')
example(true)
example(777)



/*--------------------------------------------------------------------
Напишите функцию, которая определяет является ли число простым или нет
-----------------------------------------------------------------------*/
function isPrime(num) {
    for (let i = 2; i <= Math.sqrt(num); i++) {
        if ( num % i === 0 ) {
            return false;
        }
    }
    return num > 1
}
console.log('4', isPrime(4));
console.log('5', isPrime(5));
